app/Http/Controllers/Backend/Products/ProductsController.php

    public function index(Request $request)
    {
        $searchKey = null;
        $brand_id = null;
        $is_published = null;

        $products = Product::shop()->latest();
        if ($request->search != null) {
            $products = $products->where('name', 'like', '%' . $request->search . '%');
            $searchKey = $request->search;
        }

        if ($request->brand_id != null) {
            $products = $products->where('brand_id', $request->brand_id);
            $brand_id    = $request->brand_id;
        }

        if ($request->is_published != null) {
            $products = $products->where('is_published', $request->is_published);
            $is_published    = $request->is_published;
        }

        $brands = Brand::latest()->get();
        $products = $products->paginate(paginationNumber());
---
select * from `brands` where `brands`.`deleted_at` is null order by `created_at` desc
select * from `products` where `shop_id` is null and `products`.`deleted_at` is null order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `products` where `shop_id` is null and `products`.`deleted_at` is null

    public function create()
    {

        if(request()->ajax()){
            $theme = CategoryTheme::whereIn('theme_id', (array)request()->ids)->pluck('category_id')->toArray();

            return view('backend.pages.products.products.category')->with(['categories' =>Category::find($theme)]);
        }

        $categories = Category::where('parent_id', 0)
            ->orderBy('sorting_order_level', 'desc')
            ->with('childrenCategories','themes')
            ->get();
        $brands = Brand::isActive()->get();
        $units = Unit::isActive()->get();
        $variations = Variation::isActive()->whereNotIn('id', [1, 2])->get();
        $taxes = Tax::isActive()->get();
        $tags = Tag::all();
---
select `themes`.*, `product_themes`.`product_id` as `pivot_product_id`, `product_themes`.`theme_id` as `pivot_theme_id` from `themes` inner join `product_themes` on `themes`.`id` = `product_themes`.`theme_id` where `product_themes`.`product_id` in (2)
select * from `categories` where `parent_id` = 0 and `categories`.`deleted_at` is null order by `sorting_order_level` desc
select * from `brands` where `is_active` = 1 and `brands`.`deleted_at` is null
select * from `units` where `is_active` = 1 and `units`.`deleted_at` is null
select * from `variations` where `is_active` = 1 and `id` not in (1, 2) and `variations`.`deleted_at` is null
select * from `taxes` where `is_active` = 1 and `taxes`.`deleted_at` is null
select * from `tags` where `tags`.`deleted_at` is null

            $product->meta_description = $request->meta_description;
            $product->meta_img = $request->meta_image;

            $product->save();
            # Product Localization
            $ProductLocalization = ProductLocalization::firstOrNew(['lang_key' => env('DEFAULT_LANGUAGE'), 'product_id' => $product->id]);
            $ProductLocalization->name = $request->name;
            $ProductLocalization->description = $request->description;
            $ProductLocalization->save();
---
insert into `products` (`shop_id`, `name`, `slug`, `brand_id`, `unit_id`, `sell_target`, `thumbnail_image`, `gallery_images`, `size_guide`, `description`, `short_description`, `min_price`, `max_price`, `discount_value`, `discount_type`, `stock_qty`, `is_published`, `has_variation`, `standard_delivery_hours`, `express_delivery_hours`, `min_purchase_qty`, `max_purchase_qty`, `meta_title`, `meta_description`, `meta_img`, `updated_at`, `created_at`) values ('', 'Pico', 'pico-hmftt', '1', '1', '', '8', '8,7,6', '', '<p>asd</p>', 'asd', 123, 123, '0', 'percent', '123', '1', 0, '72', '24', '1', '10', '', '', '', '2024-03-11 06:32:36', '2024-03-11 06:32:36')
select * from `product_localizations` where (`lang_key` = 'en' and `product_id` = 2) limit 1
insert into `product_localizations` (`lang_key`, `product_id`, `name`, `description`, `updated_at`, `created_at`) values ('en', 2, 'Pico', '<p>asd</p>', '2024-03-11 06:32:36', '2024-03-11 06:32:36')

            $product->tags()->sync($request->tag_ids);

            # category
            $product->categories()->sync($request->category_ids);
            $product->themes()->sync($request->theme_ids);
---
insert into `product_categories` (`category_id`, `product_id`) values (2, 2)
insert into `product_themes` (`product_id`, `theme_id`) values (2, 1)

            $taxes = array_combine($tax_ids, $tax_data);
            $product->product_taxes()->sync($taxes);

            $location = Location::where('is_default', 1)->first();
---
select * from `locations` where `is_default` = 1 and `locations`.`deleted_at` is null limit 1

                $product_variation_stock->product_variation_id    = $variation->id;
                $product_variation_stock->location_id             = $location->id;
                $product_variation_stock->stock_qty               = $request->stock;
                $product_variation_stock->save();
---
insert into `product_variation_stocks` (`product_variation_id`, `location_id`, `stock_qty`, `updated_at`, `created_at`) values (2, 1, '123', '2024-03-11 06:32:36', '2024-03-11 06:32:36')

    public function delete($id)
    {
        $product = Product::findOrFail($id);


        if(!$product->carts->isEmpty()){
            flash(localize('Product already is in customer cart'))->error();

            return back();
        }

        $product->delete();
---
select * from `products` where `products`.`id` = '1' and `products`.`deleted_at` is null limit 1
update `products` set `deleted_at` = '2024-03-11 06:31:47', `products`.`updated_at` = '2024-03-11 06:31:47' where `id` = '1'