app/Http/Middleware/ThemeMiddleware.php

    public function handle(Request $request, Closure $next)
    {
        if(Schema::hasTable('themes') && Schema::hasTable('system_settings')){
            $active_themes = getSetting('active_themes') != null ? json_decode(getSetting('active_themes')) : [1];
            $theme   = session('theme');

            // dd($active_themes, $theme);

            if(!is_null($theme)){
                $theme   = Theme::whereIn('id', $active_themes)->where('code', $theme)->first();
            }

            if(is_null($theme)){
                $theme   = Theme::where('id', $active_themes[0])->first();
---
select * from `themes` where `id` in ('1', '2') and `code` = 'default' limit 1
select * from `themes` where `id` = '1' limit 1