app/Http/Helpers/Constant.php

    function uploadedAsset($fileId)
    {
        $mediaFile = MediaManager::find($fileId);
---
select * from `media_managers` where `media_managers`.`id` is null limit 1

    function localize($key, $lang = null)
    {
        if ($lang == null) {
            $lang = App::getLocale();
        }

        $t_key = preg_replace('/[^A-Za-z0-9\_]/', '', str_replace(' ', '_', strtolower($key)));

        $localization_english = Cache::rememberForever('localizations-en', function () {
            return Localization::where('lang_key', 'en')->pluck('t_value', 't_key');
        });

        if (!isset($localization_english[$t_key])) {
            # add new localization
            newLocalization('en', $t_key, $key);
        }

        # return user session lang
        $localization_user = Cache::rememberForever("localizations-{$lang}", function () use ($lang) {
            return Localization::where('lang_key', $lang)->pluck('t_value', 't_key')->toArray();
---
select `t_value`, `t_key` from `localizations` where `lang_key` = 'en'

    function newLocalization($lang, $t_key, $key)
    {
        $localization = new Localization;
        $localization->lang_key = $lang;
        $localization->t_key = $t_key;
        $localization->t_value = str_replace(array("\r", "\n", "\r\n"), "", $key);
        $localization->save();
---
insert into `localizations` (`lang_key`, `t_key`, `t_value`, `updated_at`, `created_at`) values ('en', 'available_logistics', 'Available Logistics', '2024-03-11 06:47:56', '2024-03-11 06:47:56')

    function getSetting($key, $default = null)
    {
        try {
            $settings = Cache::remember('settings', 86400, function () {
                return SystemSetting::all();
---
select * from `system_settings`

    function getCouponDiscount($subTotal, $code = '')
    {
        $amount = 0;
        $coupon = Coupon::where('code', $code)->first();
---
select * from `coupons` where `code` = '' and `coupons`.`deleted_at` is null and 0 = 1 limit 1

    function isModuleActive($name) {

        $module = Module::find($name);
        if($module) {
            $status = $module->isEnabled();
            if($status == true) {
                $modulePath = $module->getPath() .'/Providers/RouteServiceProvider.php';
                if(file_exists($modulePath)) {
                    $module = EnmartModule::where('name', $name)->first();
---
select * from `enmart_modules` where `name` = 'Support' limit 1