app/Http/Controllers/Backend/Orders/OrdersController.php

        }

        $orders = $orders->where(function ($q) use ($posOrder) {
            $orderGroup = OrderGroup::where('is_pos_order', $posOrder)->pluck('id');
---
select `id` from `order_groups` where `is_pos_order` = 0

        });

        $orders = $orders->paginate(paginationNumber());
        $locations = Location::where('is_published', 1)->latest()->get();
---
select * from `locations` where `is_published` = 1 and `locations`.`deleted_at` is null order by `created_at` desc

    public function show($id)
    {
        $order = Order::findOrFail($id);
        $deliverymen = User::where('is_active', 1)->where('user_type', 'deliveryman')->where('location_id', $order->orderGroup->location_id)->latest()->get();
---
select * from `orders` where `orders`.`id` = '3' limit 1
select * from `users` where `is_active` = 1 and `user_type` = 'deliveryman' and `location_id` = '1' and `users`.`deleted_at` is null order by `created_at` desc

    public function assignDeliveryman(Request $request)
    {
        $order = Order::findOrFail((int)$request->order_id);
        $order->deliveryman_id = $request->deliveryman_id ?? null;
        $order->save();

        $deliveryman = User::whereId($order->deliveryman_id)->first();

        OrderUpdate::create([
            'order_id' => $order->id,
            'user_id' => auth()->user()->id,
            'note' =>  $deliveryman != null ? $deliveryman->name . ' has been assigned for delivery.' : 'Deliveryman has been removed.',
        ]);
---
select * from `orders` where `orders`.`id` = 4 limit 1
update `orders` set `deliveryman_id` = '3', `orders`.`updated_at` = '2024-03-11 11:05:04' where `id` = '4'
insert into `order_updates` (`order_id`, `user_id`, `note`, `updated_at`, `created_at`) values (4, 1, 'Otnay has been assigned for delivery.', '2024-03-11 11:05:04', '2024-03-11 11:05:04')

    public function updatePaymentStatus(Request $request)
    {
        $order = Order::findOrFail((int)$request->order_id);
        $order->payment_status = $request->status;
        $order->save();

        OrderUpdate::create([
            'order_id' => $order->id,
            'user_id' => auth()->user()->id,
            'note' => 'Payment status updated to ' . ucwords(str_replace('_', ' ', $request->status)) . '.',
        ]);
---
select * from `orders` where `orders`.`id` = 3 limit 1
update `orders` set `payment_status` = 'paid', `orders`.`updated_at` = '2024-03-11 10:58:18' where `id` = '3'
insert into `order_updates` (`order_id`, `user_id`, `note`, `updated_at`, `created_at`) values (3, 1, 'Payment status updated to Paid.', '2024-03-11 10:58:18', '2024-03-11 10:58:18')

    public function updateDeliveryStatus(Request $request)
    {
        $order = Order::findOrFail((int)$request->order_id);

        if ($order->delivery_status != orderCancelledStatus() && $request->status == orderCancelledStatus()) {
            $this->addQtyToStock($order);
        }

        if ($order->delivery_status == orderCancelledStatus() && $request->status != orderCancelledStatus()) {
            $this->removeQtyFromStock($order);
        }

        $order->delivery_status = $request->status;
        $order->save();

        OrderUpdate::create([
            'order_id' => $order->id,
            'user_id' => auth()->user()->id,
            'note' => 'Delivery status updated to ' . ucwords(str_replace('_', ' ', $request->status)) . '.',
        ]);
---
select * from `orders` where `orders`.`id` = 1 limit 1
update `orders` set `delivery_status` = 'processing', `orders`.`updated_at` = '2024-03-11 06:56:09' where `id` = '1'
insert into `order_updates` (`order_id`, `user_id`, `note`, `updated_at`, `created_at`) values (1, 1, 'Delivery status updated to Processing.', '2024-03-11 06:56:09', '2024-03-11 06:56:09')

    public function downloadInvoice($id)
    {
        if (session()->has('locale')) {
            $language_code = session()->get('locale', Config::get('app.locale'));
        } else {
            $language_code = env('DEFAULT_LANGUAGE');
        }

        if (session()->has('currency_code')) {
            $currency_code = session()->get('currency_code', Config::get('app.currency_code'));
        } else {
            $currency_code = env('DEFAULT_CURRENCY');
        }

        if (Language::where('code', $language_code)->first()->is_rtl == 1) {
---
select * from `languages` where `code` = 'en' limit 1

            $font_family = "'Roboto','sans-serif'";
        }

        $order = Order::findOrFail((int)$id);
---
select * from `orders` where `orders`.`id` = 1 limit 1