app/Http/Controllers/Frontend/CheckoutController.php

select * from `carts` where `user_id` = 2 and `location_id` = 1
select * from `user_addresses` where `user_addresses`.`user_id` = 2 and `user_addresses`.`user_id` is not null and `user_addresses`.`deleted_at` is null order by `created_at` desc
select * from `countries` where `is_active` = 1
---
    public function index()
    {
        $carts = Cart::where('user_id', auth()->user()->id)->where('location_id', session('stock_location_id'))->get();

        if (count($carts) > 0) {
            checkCouponValidityForCheckout($carts);
        }

        $user = auth()->user();
        $addresses = $user->addresses()->latest()->get();

        $countries = Country::isActive()->get();

select distinct * from `logistic_zone_cities` where `city_id` = '1'
select * from `carts` where `user_id` = 2 and `location_id` = 1
---
    public function getLogistic(Request $request)
    {
        $logisticZoneCities = LogisticZoneCity::where('city_id', $request->city_id)->distinct('logistic_id')->get();
        return [
            'logistics' => getRender('inc.logistics', ['logisticZoneCities' => $logisticZoneCities]),
            'summary'   => getRender('pages.partials.checkout.orderSummary', ['carts' => Cart::where('user_id', auth()->user()->id)->where('location_id', session('stock_location_id'))->get()])

select * from `carts` where `user_id` = 2 and `location_id` = 1
select * from `logistic_zones` where `logistic_zones`.`id` = 1 and `logistic_zones`.`deleted_at` is null limit 1
---
    public function getShippingAmount(Request $request)
    {
        $carts              = Cart::where('user_id', auth()->user()->id)->where('location_id', session('stock_location_id'))->get();
        $logisticZone       = LogisticZone::find((int)$request->logistic_zone_id);

select * from `carts` where `user_id` = 2 and `location_id` = 1
---
    public function complete(Request $request)
    {

        $user = auth()->user();
        $userId = $user->id;
        $carts  = Cart::where('user_id', $userId)->where('location_id', session('stock_location_id'))->get();

select * from `logistic_zones` where `id` = '1' and `logistic_zones`.`deleted_at` is null limit 1
---
                    $orderGroup->total_coupon_discount_amount   = getCouponDiscount(getSubTotal($carts, false), getCoupon());
                    # [done->codes below] increase coupon usage counter after successful order
                }
                $logisticZone = LogisticZone::where('id', $request->chosen_logistic_zone_id)->first();

select * from `currencies` where `code` = 'usd' limit 1
---
                } else {
                    $currency_code = env('DEFAULT_CURRENCY');
                }
                $currentCurrency = Currency::where('code', $currency_code)->first();

insert into `order_groups` (`user_id`, `shipping_address_id`, `billing_address_id`, `location_id`, `phone_no`, `alternative_phone_no`, `sub_total_amount`, `total_tax_amount`, `total_coupon_discount_amount`, `total_shipping_cost`, `total_tips_amount`, `grand_total_amount`, `order_code`, `updated_at`, `created_at`) values (2, '1', '1', 1, '62813865684646', '', 123, 0, 0, '6550', 0, 6673, 3, '2024-03-11 10:57:39', '2024-03-11 10:57:39')
---
                        return back();
                    }
                }
                $orderGroup->save();

insert into `orders` (`order_group_id`, `shop_id`, `user_id`, `location_id`, `total_admin_earnings`, `logistic_id`, `logistic_name`, `shipping_delivery_type`, `shipping_cost`, `tips_amount`, `updated_at`, `created_at`) values (3, '', 2, 1, 6673, '1', 'Jabodetabek', 'regular', '6550', 0, '2024-03-11 10:57:39', '2024-03-11 10:57:39')
---
                $order->shipping_cost                   = $orderGroup->total_shipping_cost; // todo::[update version] calculate for each vendors
                $order->tips_amount                     = $orderGroup->total_tips_amount; // todo::[update version] calculate for each vendors

                $order->save();

insert into `order_items` (`order_id`, `product_variation_id`, `qty`, `location_id`, `unit_price`, `total_tax`, `total_price`, `updated_at`, `created_at`) values (3, '2', '1', 1, '123', 0, 123, '2024-03-11 10:57:39', '2024-03-11 10:57:39')
---
                    $orderItem->unit_price           = variationDiscountedPrice($cart->product_variation->product, $cart->product_variation);
                    $orderItem->total_tax            = variationTaxAmount($cart->product_variation->product, $cart->product_variation);
                    $orderItem->total_price          = $orderItem->unit_price * $orderItem->qty;
                    $orderItem->save();

update `product_variation_stocks` set `stock_qty` = 120, `product_variation_stocks`.`updated_at` = '2024-03-11 10:57:39' where `id` = '2'
---
                    try {
                        $productVariationStock = $cart->product_variation->product_variation_stock;
                        $productVariationStock->stock_qty -= $orderItem->qty;
                        $productVariationStock->save();

update `products` set `stock_qty` = 120, `total_sale_count` = 3, `products`.`updated_at` = '2024-03-11 10:57:39' where `id` = '2'
---
                        return back();
                    }
                    $product->stock_qty -= $orderItem->qty;
                    $product->save();

select `categories`.*, `product_categories`.`product_id` as `pivot_product_id`, `product_categories`.`category_id` as `pivot_category_id` from `categories` inner join `product_categories` on `categories`.`id` = `product_categories`.`category_id` where `product_categories`.`product_id` = 2 and `categories`.`deleted_at` is null
select count(*) as aggregate from `categories` inner join `product_categories` on `categories`.`id` = `product_categories`.`category_id` where `product_categories`.`product_id` = 2 and `categories`.`deleted_at` is null
update `categories` set `total_sale_count` = 3, `categories`.`updated_at` = '2024-03-11 10:57:39' where `id` = '2'
delete from `carts` where `id` = '3'
---


                    # category sales count
                    if ($product->categories()->count() > 0) {
                        foreach ($product->categories as $category) {
                            $category->total_sale_count += $orderItem->qty;
                            $category->save();
                        }
                    }
                    $cart->delete();

update `orders` set `reward_points` = 0, `orders`.`updated_at` = '2024-03-11 10:57:39' where `id` = 3
---
                }

                $order->reward_points = $total_points;
                $order->save();

update `order_groups` set `payment_method` = '', `order_groups`.`updated_at` = '2024-03-11 10:57:39' where `id` = 3
---
                # payment gateway integration & redirection

                $orderGroup->payment_method = $request->payment_method;
                $orderGroup->save();

select * from `order_groups` where `user_id` = 2 and `order_code` = '2' limit 1
select * from `orders` where `orders`.`order_group_id` = 2 and `orders`.`order_group_id` is not null limit 1
---
    public function success($code)
    {
        $orderGroup = OrderGroup::where('user_id', auth()->user()->id)->where('order_code', $code)->first();
        $user = auth()->user();

        // todo:: change this from here
        try {
            Notification::send($user, new OrderPlacedNotification($orderGroup->order));